In [1]:
!bq --location=US mk --dataset imdb_modeled

Dataset 'swift-area-266618:imdb_modeled' successfully created.

In [27]:
%%bigquery
create table imdb_modeled.Movies as 
select distinct *
from imdb_staging.Movies

Empty DataFrame
Columns: []
Index: []

In [28]:
%%bigquery
create table imdb_modeled.Ratings as 
select distinct *
from imdb_staging.Ratings

Empty DataFrame
Columns: []
Index: []

In [64]:
%%bigquery
CREATE table imdb_modeled.Actors AS
SELECT * EXCEPT(primary_profession, job, ordering, actors, production_company, place_of_death, reason_of_death, imdb_name_id, date_of_death), date_of_death as reason_of_death, generate_uuid() as actor_name_id
FROM imdb_staging.Names n INNER JOIN imdb_staging.Title_Principals t USING (imdb_name_id)
WHERE t.category = "actor"

Empty DataFrame
Columns: []
Index: []

In [2]:
%%bigquery
CREATE table imdb_modeled.Directors AS
SELECT * EXCEPT(primary_profession, job, actors, production_company, ordering, place_of_death, reason_of_death, imdb_name_id, date_of_death), generate_uuid() as director_name_id, date_of_death as reason_of_death
FROM imdb_staging.Names n INNER JOIN imdb_staging.Title_Principals t USING (imdb_name_id)
WHERE t.category = "director"

Empty DataFrame
Columns: []
Index: []

In [3]:
%%bigquery
CREATE table imdb_modeled.Writers AS
SELECT * EXCEPT(primary_profession, job, actors, production_company, ordering, place_of_death, reason_of_death, imdb_name_id, date_of_death), generate_uuid() as writer_name_id, date_of_death as reason_of_death
FROM imdb_staging.Names n INNER JOIN imdb_staging.Title_Principals t USING (imdb_name_id)
WHERE t.category = "writer"

Empty DataFrame
Columns: []
Index: []

In [9]:
%%bigquery
select cast(date_of_birth as date) as date_of_birth
from imdb_modeled.Names

Executing query with job ID: 44c21943-131f-43fb-8728-2033f8e160c6
Query executing: 0.21s

ERROR:
 404 Not found: Table swift-area-266618:imdb_modeled.Names was not found in location US

(job ID: 44c21943-131f-43fb-8728-2033f8e160c6)

            -----Query Job SQL Follows-----

    |    .    |    .    |    .    |    .    |    .    |
   1:select cast(date_of_birth as date) as date_of_birth
   2:from imdb_modeled.Names
    |    .    |    .    |    .    |    .    |    .    |

In [8]:
%%bigquery
select cast(date_of_death as date) as date_of_death
from imdb_modeled.Actors

Executing query with job ID: 5804af48-7ea8-4051-9a18-c0feff006b78
Query executing: 0.27s

ERROR:
 404 Not found: Table swift-area-266618:imdb_modeled.Names was not found in location US

(job ID: 5804af48-7ea8-4051-9a18-c0feff006b78)

            -----Query Job SQL Follows-----

    |    .    |    .    |    .    |    .    |    .    |
   1:select cast(date_of_death as date) as date_of_death
   2:from imdb_modeled.Names
    |    .    |    .    |    .    |    .    |    .    |

In [7]:
%%bigquery
select cast(usa_gross_income as INT64) as usa_gross_income
from imdb_modeled.Movies

Executing query with job ID: 54c72928-e341-4c90-9603-0a1b4563e0bb
Query executing: 0.96s

ERROR:
 400 GET https://bigquery.googleapis.com/bigquery/v2/projects/swift-area-266618/queries/54c72928-e341-4c90-9603-0a1b4563e0bb?location=US&timeoutMs=400&maxResults=0: Bad int64 value: $ 69225

(job ID: 54c72928-e341-4c90-9603-0a1b4563e0bb)

                -----Query Job SQL Follows-----

    |    .    |    .    |    .    |    .    |    .    |
   1:select cast(usa_gross_income as INT64) as usa_gross_income
   2:from imdb_modeled.Movies
    |    .    |    .    |    .    |    .    |    .    |

In [6]:
%%bigquery
select cast(worlwide_gross_income as INT64) as worlwide_gross_income
from imdb_modeled.Movies

Executing query with job ID: 51b09a88-e80d-4701-9ca4-a94fec4f9510
Query executing: 0.49s

ERROR:
 400 GET https://bigquery.googleapis.com/bigquery/v2/projects/swift-area-266618/queries/51b09a88-e80d-4701-9ca4-a94fec4f9510?location=US&timeoutMs=0&maxResults=0: Bad int64 value: $ 67522

(job ID: 51b09a88-e80d-4701-9ca4-a94fec4f9510)

                     -----Query Job SQL Follows-----

    |    .    |    .    |    .    |    .    |    .    |    .    |
   1:select cast(worlwide_gross_income as INT64) as worlwide_gross_income
   2:from imdb_modeled.Movies
    |    .    |    .    |    .    |    .    |    .    |    .    |

In [4]:
%%bigquery
select cast(birth_year as INT64) as birth_year
from imdb_modeled.Actors
order by birth_year

        birth_year
0              NaN
1              NaN
2              NaN
3              NaN
4              NaN
...            ...
100490      2006.0
100491      2006.0
100492      2007.0
100493      2007.0
100494      2008.0

[100495 rows x 1 columns]

In [5]:
%%bigquery
select cast(death_year as INT64) as death_year
from imdb_modeled.Actors
order by death_year

        death_year
0              NaN
1              NaN
2              NaN
3              NaN
4              NaN
...            ...
100490      2019.0
100491      2019.0
100492      2019.0
100493      2019.0
100494      2019.0

[100495 rows x 1 columns]

In [10]:
%%bigquery
select cast(date_published as date) as date_published
from imdb_modeled.Movies

Executing query with job ID: 06ec3589-9f96-4fea-8f10-c0cc50ea6e87
Query executing: 0.51s

ERROR:
 400 GET https://bigquery.googleapis.com/bigquery/v2/projects/swift-area-266618/queries/06ec3589-9f96-4fea-8f10-c0cc50ea6e87?location=US&timeoutMs=400&maxResults=0: Invalid date: '1979'

(job ID: 06ec3589-9f96-4fea-8f10-c0cc50ea6e87)

             -----Query Job SQL Follows-----

    |    .    |    .    |    .    |    .    |    .    |
   1:select cast(date_published as date) as date_published
   2:from imdb_modeled.Movies
    |    .    |    .    |    .    |    .    |    .    |

In [13]:
%%bigquery
select cast(budget as INT64) as budget
from imdb_modeled.Movies

Executing query with job ID: d509993b-0a99-4b22-868e-f71579f55374
Query executing: 0.33s

ERROR:
 400 GET https://bigquery.googleapis.com/bigquery/v2/projects/swift-area-266618/queries/d509993b-0a99-4b22-868e-f71579f55374?location=US&timeoutMs=400&maxResults=0: Bad int64 value: GBP 80000

(job ID: d509993b-0a99-4b22-868e-f71579f55374)

      -----Query Job SQL Follows-----

    |    .    |    .    |    .    |
   1:select cast(budget as INT64) as budget
   2:from imdb_modeled.Movies
    |    .    |    .    |    .    |